clear,clc;
%每种货物的需求量，单位t
m=[18 15 23 12];
%每种货物的体积，单位m^3/t
v=[480 650 580 390];
%利润,单位千元
s=[3100 3800 3500 2850];
%限重,单位t
lim_m=[10 16 8];
%限体,单位1000m^3
lim_v=[6800 8700 5300];
f=[3100 3100 3100 3800 3800 3800 3500 3500 3500 2850 2850 2850];
%需求重量矩阵
A1=zeros(4,12);
%船舱限重
A2=zeros(3,12);
%船舱体积矩阵
A3=zeros(3,12);
% for i=1:4
%     A1(i,(i-1)*3+1:3*i)=m(i);
% end
A4=zeros(3,12);
for i=1:3
    for j=1:4
        A2(i,(i-1)*4+j)=m(1,j);
        A3(i,(i-1)*4+j)=v(1,j);
    end
    A4(i,(i-1)*3+1:3*i)=1;
end
A=A3;
b=lim_v';
Aeq=A2;
beq=lim_m';
lb=zeros(1,12);
[x,y]=linprog(f,A,b,Aeq,beq,lb);
x,y